In [1]:
import os
from pathlib import Path
import pandas as pd
#Get Current File Path
full_path = os.getcwd()
#Set Project File Path
ProjectPath = str(Path(full_path).parents[0])

df = pd.read_excel(ProjectPath + '\\data\\raw\\Titanic_Test.xlsx', sheet_name='test')
df.head(1)

C:\Users\cjyi3\AppData\Local\Temp\ipykernel_17080\1302754007.py:3: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

## Keep, Drop, Rearrange, Rename Columns

### Keep Specific Columns

In [14]:
#Keep Columns
df1 = df[['PassengerId','Pclass','Name']]
df1.head(1)

   PassengerId  Pclass              Name
0          892       3  Kelly, Mr. James

### Drop Specific Columns

In [16]:
#Drop 1 column
df1 = df.drop('Name',axis=1)
df1.head(1)

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,male,34.5,0,0,330911,7.8292,NaN,Q

In [17]:
#Drop Multiple Columns
df1 = df.drop(['PassengerId','Name'],axis=1)
df1.head(1)

   Pclass   Sex   Age  SibSp  Parch  Ticket    Fare Cabin Embarked
0       3  male  34.5      0      0  330911  7.8292   NaN        Q

### Rearrange Columns

In [19]:
#Rearrange Columns
df1 = df[['PassengerId','Name','Pclass','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked']]
df1.head(1)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,"Kelly, Mr. James",3,male,34.5,0,0,330911,7.8292,NaN,Q

### Rename Columns

In [8]:
df1 = df.copy(deep=True)
df1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [13]:
#Make a copy
df1 = df.copy(deep=True)
#Rename Columns (order of the columns are important here)
#This method renames all columns
df1.columns = ['PassengerId1','Pclass1','Name1','Sex1','Age1','SibSp1','Parch1','Ticket1','Fare1','Cabin1','Embarked1']
df1.head(1)

,PassengerId1,Pclass1,Name1,Sex1,Age1,SibSp1,Parch1,Ticket1,Fare1,Cabin1,Embarked1
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [14]:
#To rename only one column/specific columns:
df1.rename(columns={'Name1': 'FullName', 'Age1': 'Age'}, inplace=True)
df1.head(1)

,PassengerId1,Pclass1,FullName,Sex1,Age,SibSp1,Parch1,Ticket1,Fare1,Cabin1,Embarked1
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

## Filtering and Subsets

In [36]:
#Using .query() for filtering or subset
df1 = df.query('(Sex=="male") & (Age<20)')
print(len(df))
print(len(df1))
df1.head(5)

418
33

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
21,913,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S
35,927,3,"Katavelas, Mr. Vassilios (Catavelas Vassilios"")""",male,18.5,0,0,2682,7.2292,NaN,C
55,947,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.1250,NaN,Q
60,952,3,"Dika, Mr. Mirko",male,17.0,0,0,349232,7.8958,NaN,S

In [35]:
#Using .loc for filtering or subset
df1 = df.loc[(df['Sex'] == 'male') & (df['Age']<20)]
print(len(df))
print(len(df1))
df1.head(5)

418
33

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
21,913,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S
35,927,3,"Katavelas, Mr. Vassilios (Catavelas Vassilios"")""",male,18.5,0,0,2682,7.2292,NaN,C
55,947,3,"Rice, Master. Albert",male,10.0,4,1,382652,29.1250,NaN,Q
60,952,3,"Dika, Mr. Mirko",male,17.0,0,0,349232,7.8958,NaN,S

## Replace values using np.where

In [8]:
#Make a copy
df1 = df.copy(deep=True)
import numpy as np
#if sex = male, then =M else return original value
df1['Sex'] = np.where(df1['Sex']=="male","M",df1['Sex'])
df1.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",M,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",M,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",M,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Substring

In [6]:
#Make a copy
df1 = df.copy(deep=True)

#Change Sex column from male to M and female to F using substring.
#Substring is a way to extract a part of a string. In this case we just take the first letter in the column 'Sex'.
df1['Sex1'] = df['Sex'].str[:1]
df1[['Sex','Sex1']].head()

      Sex Sex1
0    male    m
1  female    f
2    male    m
3    male    m
4  female    f

## Count # of Rows of dataframe

In [6]:
len(df)

418

In [7]:
#to count how many rows of data where the passanger is male (combining len() and .query()):
len(df.query('Sex=="male"'))

266

## Removing Blankspace

### Removing leading and trailing blanks

In [15]:
#Make a copy
df1 = df.copy(deep=True)

df1['Name1'] = df1['Name'].str.strip()
df1[['Name','Name1']].head(5)

,Name,Name1
0,"Kelly, Mr. James","Kelly, Mr. James"
1,"Wilkes, Mrs. James (Ellen Needs)","Wilkes, Mrs. James (Ellen Needs)"
2,"Myles, Mr. Thomas Francis","Myles, Mr. Thomas Francis"
3,"Wirz, Mr. Albert","Wirz, Mr. Albert"
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)","Hirvonen, Mrs. Alexander (Helga E Lindqvist)"

### Remove all space (compress)

In [38]:
#Make a copy
df1 = df.copy(deep=True)

df1['Name1'] = df1['Name'].replace(' ','')
df1[['Name','Name1']].head(5)

,Name,Name1
0,"Kelly, Mr. James","Kelly, Mr. James"
1,"Wilkes, Mrs. James (Ellen Needs)","Wilkes, Mrs. James (Ellen Needs)"
2,"Myles, Mr. Thomas Francis","Myles, Mr. Thomas Francis"
3,"Wirz, Mr. Albert","Wirz, Mr. Albert"
4,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)","Hirvonen, Mrs. Alexander (Helga E Lindqvist)"

### Remove multiple space and only keep 1 space in between each words

In [64]:
import pandas as pd

# Sample DataFrame
data = {'Column_with_blanks': ['This   is   a   sentence', 'Another     example', '    More   blanks']}
df1 = pd.DataFrame(data)

print('before removing the blanks:')
for i in df1['Column_with_blanks'].tolist():
    print(i)

#add multiple spaces in between Name Column:
df1['Column_with_blanks'] = df1['Column_with_blanks'].str.replace(r'\s+', ' ', regex=True)
print('-------------')
print('')
print('after removing the blanks:')
for i in df1['Column_with_blanks'].tolist():
    print(i)

before removing the blanks:
This   is   a   sentence
Another     example
    More   blanks
-------------

after removing the blanks:
This is a sentence
Another example
 More blanks

## Capitalize words

In [67]:
#Make a copy
df1 = df.copy(deep=True)

df1['Name1'] = df1['Name'].str.upper()
df1.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name1
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,"KELLY, MR. JAMES"
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,"WILKES, MRS. JAMES (ELLEN NEEDS)"
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,"MYLES, MR. THOMAS FRANCIS"
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,"WIRZ, MR. ALBERT"
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,"HIRVONEN, MRS. ALEXANDER (HELGA E LINDQVIST)"

## Sort tables

In [68]:
#Make a copy
df1 = df.copy(deep=True)

#Sort Ascending
df1 = df1.sort_values(by=['Pclass'])
df1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
208,1100,1,"Rosenbaum, Miss. Edith Louise",female,33.0,0,0,PC 17613,27.7208,A11,C
350,1242,1,"Greenfield, Mrs. Leo David (Blanche Strouse)",female,45.0,0,1,PC 17759,63.3583,D10 D12,C
122,1014,1,"Schabert, Mrs. Paul (Emma Mock)",female,35.0,1,0,13236,57.7500,C28,C
343,1235,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C
131,1023,1,"Gracie, Col. Archibald IV",male,53.0,0,0,113780,28.5000,C51,C
...,...,...,...,...,...,...,...,...,...,...,...
165,1057,3,"Kink-Heilmann, Mrs. Anton (Luise Heilmann)",female,26.0,1,1,315153,22.0250,NaN,S
163,1055,3,"Pearce, Mr. Ernest",male,NaN,0,0,343271,7.0000,NaN,S
161,1053,3,"Touma, Master. Georges Youssef",male,7.0,1,1,2650,15.2458,NaN,C
199,1091,3,"Rasmussen, Mrs. (Lena Jacobsen Solvang)",female,NaN,0,0,65305,8.1125,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [69]:
#Sort Descending
df1 = df1.sort_values(by=['Pclass'], ascending=False)
df1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
409,1301,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
289,1181,3,"Ford, Mr. Arthur",male,NaN,0,0,A/5 1478,8.0500,NaN,S
72,964,3,"Nieminen, Miss. Manta Josefina",female,29.0,0,0,3101297,7.9250,NaN,S
76,968,3,"Miles, Mr. Frank",male,NaN,0,0,359306,8.0500,NaN,S
79,971,3,"Doyle, Miss. Elizabeth",female,24.0,0,0,368702,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
403,1295,1,"Carrau, Mr. Jose Pedro",male,17.0,0,0,113059,47.1000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
41,933,1,"Franklin, Mr. Thomas Parham",male,NaN,0,0,113778,26.5500,D34,S
402,1294,1,"Gibson, Miss. Dorothy Winifred",female,22.0,0,1,112378,59.4000,NaN,C
208,1100,1,"Rosenbaum, Miss. Edith Louise",female,33.0,0,0,PC 17613,27.7208,A11,C

In [72]:
#Sort by multiple columns
## Sort Ascending for Pclass and descending in PassengerId
df1 = df1.sort_values(by=['Pclass','PassengerId'], ascending=[True,False])
df1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
407,1299,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
404,1296,1,"Frauenthal, Mr. Isaac Gerald",male,43.0,1,0,17765,27.7208,D40,C
403,1295,1,"Carrau, Mr. Jose Pedro",male,17.0,0,0,113059,47.1000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

## Remove Duplicates

In [75]:
#Make a copy
df1 = df.copy(deep=True)
df1 = df1[['Sex','Pclass']]
df1 = df1.drop_duplicates()
df1

       Sex  Pclass
0     male       3
1   female       3
2     male       2
11    male       1
12  female       1
15  female       2

### Keep First and Last Row

In [80]:
#Make a copy
df1 = df.copy(deep=True)

#Find the first passenger ID that is Pclass = 2 and Sex = female
## First you need to filter for Pclass =2 and Sex = female then sort the dataframe then use .drop_duplicates() to keep the first row
## in the final result, you should have only 1 row. where the data showing the first passengerID who is Pclass 2 and Sex = female
df1 = df1.query('Pclass==2 & Sex =="female"').sort_values(by=['PassengerId'], ascending=[True])
df1 = df1.drop_duplicates(subset=['Pclass', 'Sex'], keep='first')
df1

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C

## Merge tables

In [12]:
#Make a copy
df1 = df.copy(deep=True)

# Create a new table using Pclass:
Class = pd.DataFrame({'PassClass':[1,2,3,4],
                      'ClassName':['First','Second','Third','Others']})

#merge tables
#left_on and right_on are column names based on the first dataframe and the second dataframe
#how can be left, right, inner, outer join (similar to sql join)
#You may put indicator = True to show which table each row came from.
#Both means there is a match on both tables, left_only indicates there is a match in the left table no matches can be found in the right table, 
#while 'right_only' indicates there is a match in the right table but no match can be found in the right table.
df2 = df1.merge(Class, left_on='Pclass', right_on='PassClass', how='left', indicator=True)
df2.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,PassClass,ClassName,_merge
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,3,Third,both
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,3,Third,both
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,2,Second,both
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,3,Third,both
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,3,Third,both

### Merge based on index

In [ ]:
df_merge = df1.merge(df2, left_index=True, right_index=True, how='inner')
#how = can be {â€˜leftâ€™, â€˜rightâ€™, â€˜outerâ€™, â€˜innerâ€™, â€˜crossâ€™}, default â€˜innerâ€™}

### More info on Merge in pandas

https://stackoverflow.com/questions/53645882/pandas-merging-101

## Append/Concatenate tables

In [23]:
#Make a copy
df1 = df.copy(deep=True)

testdf = pd.DataFrame({'PassengerId':[4000],'Pclass':[4],'Name':['Testing'],'Sex':['male'],'Age':[0],'SibSp':[0],'Parch':[0],'Ticket':['Test'],'Fare':[0.00],'Cabin':['T'],'Embarked':['T']})
testdf

#appending 2 tables
#ignore_index = True means it will create a new index (resetting the index)
df2 = pd.concat([df1, testdf], ignore_index=True)
df2

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C
418,4000,4,Testing,male,0.0,0,0,Test,0.0000,T,T

## Converting columns to string/int/datetime

In [ ]:
#to change date format from string/numeric date 'YYYYMMDD' to date format
T_df['Date'] = pd.to_datetime(T_df['Date'], format='%Y%m%d', errors='coerce')

## Keep alpha and numeric

In [13]:
testdf = pd.DataFrame({'PassengerId':[4000],'Pclass':[4],'Name':['Testing'],'Sex':['male'],'Age':[0],'SibSp':[0],'Parch':[0],'Ticket':['Test'],'Fare':[0.00],'Cabin':['T//*111'],'Embarked':['T']})

#remove special characters
testdf['Cabin'] = testdf['Cabin'].str.replace(r'[^A-Za-z0-9]', '', regex=True)
testdf

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,4000,4,Testing,male,0,0,0,Test,0.0,T111,T

## Common .query() codes

In [2]:
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
#Make a copy
df1 = df.copy(deep=True)

#If you have a list of names you want to select, you can use the 'in' operator in the query method.
#List of names to select
GenderList = ['male']

df1.query('Sex in @GenderList')

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
...,...,...,...,...,...,...,...,...,...,...,...
409,1301,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
410,1302,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,NaN,Q
411,1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
412,1304,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C

In [ ]:
GenderList = ['male']
#if you want to select names not in the list
df1.query('Sex not in @GenderList')

## Transpose dataframe

In [2]:
import numpy as np
import pandas as pd

dataInput = {'MaleNum': [2, 3], 'FemaleNum': [4, 5]}
df = pd.DataFrame(data=dataInput)
df

   MaleNum  FemaleNum
0        2          4
1        3          5

In [3]:
df_T = df.T # or you can also use df.transpose()
df_T

           0  1
MaleNum    2  3
FemaleNum  4  5

## Using .melt() to convert dataframe to long format

In [11]:
# Sample Data
df = pd.DataFrame({
    'Name': ['Student A', 'Student B', 'Student C'],
    'Math': [90, 85, 95],
    'Science': [80, 89, 92],
    'English': [70, 78, 85]
})

df

        Name  Math  Science  English
0  Student A    90       80       70
1  Student B    85       89       78
2  Student C    95       92       85

In [13]:
# Use .melt()
# id_vars = specify the columns that you want to keep as columns
# value_vars = specify the columns that you want to melt or making into rows
# var_name = name of the new column that contains the names of the melted columns or the columns that is made into rows
# value_name = name of the new column that contains the values of the melted columns or the columns that is made into rows
df2 = pd.melt(df, id_vars=['Name'], value_vars=['Math', 'Science', 'English'], 
                    var_name='Subject', value_name='Score')
df2

        Name  Subject  Score
0  Student A     Math     90
1  Student B     Math     85
2  Student C     Math     95
3  Student A  Science     80
4  Student B  Science     89
5  Student C  Science     92
6  Student A  English     70
7  Student B  English     78
8  Student C  English     85

## Adding Leading 0s to a column

In [4]:
df1 = df.copy(deep=True)
# add leading 0s to the PassengerId column in total make it 6 digits
df1['PassengerId'] = df1['PassengerId'].apply(lambda x: '{0:0>6}'.format(x))
df1.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,000892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [5]:
df1 = df.copy(deep=True)
#another method to add leading 0s
##to convert int to string then add leading 0
df1['PassengerId'] = df1['PassengerId'].astype(str).str.zfill(6)
df1.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,000892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

## Random Sampling

### Randomly select based on percentage

In [7]:
#select 50% of data
#random_state = 1, where 1 is the seed value, which ensures that the same sample will be selected (where the result is reproducible)
df1 = df.sample(frac=0.5, random_state=1)
df1.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
358,1250,3,"O'Keefe, Mr. Patrick",male,NaN,0,0,368402,7.75,NaN,Q

### Randomly select based on number of rows

In [8]:
#where n = 10 means select 10 rows
#random_state = 1, where 1 is the seed value, which ensures that the same sample will be selected (where the result is reproducible)
df1 = df.sample(n=10, random_state=1)
df1.head(1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
358,1250,3,"O'Keefe, Mr. Patrick",male,NaN,0,0,368402,7.75,NaN,Q

## If...Then...Create New column based on conditions

### If exact match

In [ ]:
# if Col1 = A then create Col2 where Col2 value is A2.
# if Col1 = B then create Col2 where Col2 value is B2.

df.loc[df['COL1'] == "A", 'COL2'] = 'A2'
df.loc[df['COL1'] == "B", 'COL2'] = 'B2'
df.loc[df['COL1'] == "C", 'COL2'] = 'C2'
df.loc[df['COL1'] == "D", 'COL2'] = 'D2'
df.loc[df['COL1'] == "E", 'COL2'] = 'E2'

### Using np.where()

In [ ]:
import numpy as np
df['COL2'] == np.where(df['COL1']=="A", "A2",
                       np.where(df['COL1']=="B", "B2",
                                np.where(df['COL1']=="C", "C2",
                                         np.where(df['COL1']=="D", "D2","E2"))))

#This functions just like if(logical_test,[value_if_true],[value_if_false]) in excel

In [ ]:
## You can also use np.where on multiple elements in a list and assign the same function to each element:
## For example if you want to assign A and B of COL1 to A2 in COL2, you may do the following:
Col1List = ['A', 'B']
df['COL2'] == np.where(df['COL1'].isin(Col1List), "A2",
                        np.where(df['COL1']=="C", "C2",
                            np.where(df['COL1']=="D", "D2","E2")))

## To Get Specific Information of a dataframe

### Data/Column Type

In [18]:
df1 = df.copy(deep=True)
df1.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Some basic Statistics

In [21]:
#get the average of Age column
df1['Age'].mean()

30.272590361445783

In [35]:
#get the mode of Age column
df1['Age'].mode()

0    21.0
1    24.0
Name: Age, dtype: float64

In [36]:
#get the median of Age column
df1['Age'].median()

27.0

In [38]:
#get the standard deviation of Age column
df1['Age'].std()

14.181209235624422

In [ ]:
#get sum of column
df1['Fare'].sum()

In [31]:
#get distinct values (sort first then get unique values)
df1['PassengerId'].sort_values().unique()

array([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,  902,
        903,  904,  905,  906,  907,  908,  909,  910,  911,  912,  913,
        914,  915,  916,  917,  918,  919,  920,  921,  922,  923,  924,
        925,  926,  927,  928,  929,  930,  931,  932,  933,  934,  935,
        936,  937,  938,  939,  940,  941,  942,  943,  944,  945,  946,
        947,  948,  949,  950,  951,  952,  953,  954,  955,  956,  957,
        958,  959,  960,  961,  962,  963,  964,  965,  966,  967,  968,
        969,  970,  971,  972,  973,  974,  975,  976,  977,  978,  979,
        980,  981,  982,  983,  984,  985,  986,  987,  988,  989,  990,
        991,  992,  993,  994,  995,  996,  997,  998,  999, 1000, 1001,
       1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012,
       1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023,
       1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 1033, 1034,
       1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045,
       1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056,
       1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067,
       1068, 1069, 1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1078,
       1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089,
       1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100,
       1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111,
       1112, 1113, 1114, 1115, 1116, 1117, 1118, 1119, 1120, 1121, 1122,
       1123, 1124, 1125, 1126, 1127, 1128, 1129, 1130, 1131, 1132, 1133,
       1134, 1135, 1136, 1137, 1138, 1139, 1140, 1141, 1142, 1143, 1144,
       1145, 1146, 1147, 1148, 1149, 1150, 1151, 1152, 1153, 1154, 1155,
       1156, 1157, 1158, 1159, 1160, 1161, 1162, 1163, 1164, 1165, 1166,
       1167, 1168, 1169, 1170, 1171, 1172, 1173, 1174, 1175, 1176, 1177,
       1178, 1179, 1180, 1181, 1182, 1183, 1184, 1185, 1186, 1187, 1188,
       1189, 1190, 1191, 1192, 1193, 1194, 1195, 1196, 1197, 1198, 1199,
       1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 1209, 1210,
       1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1219, 1220, 1221,
       1222, 1223, 1224, 1225, 1226, 1227, 1228, 1229, 1230, 1231, 1232,
       1233, 1234, 1235, 1236, 1237, 1238, 1239, 1240, 1241, 1242, 1243,
       1244, 1245, 1246, 1247, 1248, 1249, 1250, 1251, 1252, 1253, 1254,
       1255, 1256, 1257, 1258, 1259, 1260, 1261, 1262, 1263, 1264, 1265,
       1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276,
       1277, 1278, 1279, 1280, 1281, 1282, 1283, 1284, 1285, 1286, 1287,
       1288, 1289, 1290, 1291, 1292, 1293, 1294, 1295, 1296, 1297, 1298,
       1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
      dtype=int64)

In [33]:
#get distinct count use .unique()
print(len(df1['PassengerId'].unique())) 

#or use .value_counts()
print(len(df1['PassengerId'].value_counts()))

418
418